Revit 2026 API

# ParameterTypeIdAnalyticalHeatTransferCoefficient Property

---

"Heat Transfer Coefficient (U)"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId AnalyticalHeatTransferCoefficient { get; }
```
```vb
Public Shared ReadOnly Property AnalyticalHeatTransferCoefficient As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ AnalyticalHeatTransferCoefficient {
	ForgeTypeId^ get ();
}
```
```fsharp
static member AnalyticalHeatTransferCoefficient : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace